--실습 3) 주문 데이터로 데이터 가공하기 연습
--2021년 6월 1일 하루동안의 주문 건
--실제 존재하는 패션 이커머스 데이터라고 생각하고 분석을 진행해 주세요!


--1. 원하는 형식으로 컬럼 가공하기--------------------------------------------------------------

--a) 숫자를 문자열로 바꿔주기

--b) 문자열 컬럼에서 일부만 잘라내기

--c) yyyy-mm-dd 형식으로 이어주기

--d) null 값인 경우 임의값으로 바꿔주기

--e) 내가 원하는 컬럼 추가해보기

--f) 연령대 그룹 만들어보기 (20대, 30대, 40대)

--g) TOP3 카테고리와 그 외 상품의 매출액 비교하기

--h) 특정 키워드가 담긴 상품과 그렇지 않은 상품의 매출 비교하기 (+item 개수도 같이 확인!)



--2. 날짜 관련 함수 활용하기--------------------------------------------------------------

--a) 오늘을 나타내는 기본 구문

--b) 날짜 형식에서 문자 형식으로 변환하기

--c) 날짜 더하기/빼기

--d 날짜로부터 연도, 월, 주 확인하기

--d) 최근 1년 동안의 매출액 확인하기



--3. 할인률, 판매가, 이익률 계산하기



--4. 고객 관점에서의 분석 (인당 평균 구매수량 / 인당 평균 구매금액)

--100명의 고객이 구매를 하였고, 총 판매수량이 200개
--인당 평균 구매수량 = 총 판매수량 / 총 고객 수
--인당 평균 구매금액 = 총 구매금액 / 총 고객 수

--인당 구매수량이 높은 상품은?

--인당 구매금액이 높은 성/연령대는? (지난 실습에서, 단순 구매금액 총합으로는 20대 여성이 높았는데...!)
